{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 224, 224, 1], "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "strides": [2, 2], "filters": 32, "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "dtype": "float32", "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "strides": [1, 1], "filters": 32, "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_5", "strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "strides": [1, 1], "filters": 64, "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_6", "strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "units": 224, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "units": 5, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "softmax"}}], "keras_version": "2.0.8", "backend": "tensorflow"}